#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)

	ЗаполнитьЦеныНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	Если Объект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЦеныНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьЦены();
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецПроцедуры

#КонецОбласти
